/*
 * Напиши скрипт вибору готеля по кількості зірок.
 * 1,2 - 20$,  3,4 - 50$,  5 - 120$
 *
 * Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
 * 'Токої кількості зірок немає'
 */

const stars = 6;
let price;
// Звичайний if

// if (stars === 1 || stars === 2) {
//     price = '20$';
//     console.log(price);
// } else if (stars === 3 || stars === 4){
//     price = '50$';
//     console.log(price);
// }else if (stars === 5){
//     price = '120$';
//     console.log(price);
// }else{
//     console.log('Такої кількості зірок немає')
// }
// переписуємо на switch
switch (key) {
    case value:
        
        break;

    default:
        break;
}

switch (stars) { 
    case 3: 
    case 4: 
        price = '50$';
        console.log(price);        
        break;    
    case 5: 
        price = '120$';
        console.log(price);        
        break;
    case 1: 
    case 2: 
        price = '20$';
        console.log(price);        
        break;
    default:
        console.log('Такої кількості зірок немає')
        break;
}
cl







/*
 * Напиши скрипт вибору опції доставки товару.
 * Опція зберігається в змінній option: 1 - самовивоз, 2 - кур"єр, 3 - пошта
 *
 * В змінну message записати повідомлення в залежності від опції.
 * - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
 * - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
 * - 'Посилка буде відправлена сьогодні'
 * - 'Вам передзвонит менеджер'
 */

// 1 створюємо змінні
// 2. робимо світч
// 3. перевіряємо на рівність опцію і виводимо повідомлення
// 4. дефолтне повідомлення