// Створіть дві змінні для зберігання числових значень. Обчисліть їх суму. 
// Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — 
// "Сума менша або дорівнює 10".

const number1 = 4;
const number2 = 8;
const sum = number1 + number2;
if(sum > 10){
    console.log("Сума більша за 10")
}else{
    console.log("Сума менша або дорівнює 10")
}
/*
 * Напиши скрипт який перевірить входження 
 * числа у відрізок зазначень x1 та x2. *
 * - До x1
 * - Після x2
 * - Від x1 до x2
 * - До x1 або після x2
 */
//                  10                      30 
// ================================================================
//                  x1                      x2
const x1 = 10;
const x2 = 30;
const number = 40;

console.log(`Число ${number} потрапляє у відрізок до ${x1}? `, );

console.log(`Число ${number} потрапляє у відрізок після ${x2}? `, );

console.log(`Число ${number} потрапляє у відрізок від ${x1} до ${x2}?`, );

console.log(`Число ${number} потрапляє у відрізок до ${x1} або після ${x2}?`, );

/*
 * Напиши скрипт який перевіряє можливість відкрити чат з користувачем.
 * Для цього користувач повинен бути:
 * - другом
 * - онлайн
 * - без режиму не турбувати
 */

const isOnline = true;
const isFriend = true;
const isDnd = true;

// const canOpenChat = ;

// console.log('Можна відкрити чат? ', canOpenChat);

/*
 * Напиши скрипт перевірки підписки користувача під час доступу до контенту
 * - Є три типи підписки: free, pro и vip.
 * - Отримати доступ можуть тільки pro и vip
 */

const sub = 'vip';

// якщо користувач pro або користувач vip тоді є доступ
//                          false            true
// const canAccessContent =;


console.log('Є доступ до контенту? ', canAccessContent);

/*
 * Напиши скрипт підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */

const totalSpent = 2000;
let payment = 500;
let discount = 0;




// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'